<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [37]:
# ипорт библиотек
import pandas as pd
import psycopg2

In [90]:
# параметры подключения к БД
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [91]:
# подключение к БД
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [40]:
# текст запроса
# выборка количества из таблицы vacancies без условий
query_3_1 = f'''
select count(*)
from vacancies
'''

In [41]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_3_1, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\2040160019.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_1, connection))

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [42]:
# текст запроса
# выборка количества из таблицы employers без условий
query_3_2 = f'''
select count(*)
from employers
'''

In [43]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_3_2, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\4003782172.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_2, connection))

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [44]:
# текст запроса
# выборка количества из таблицы areas без условий
query_3_3 = f'''
select count(*)
from areas
'''

In [45]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_3_3, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\4111369437.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_3, connection))

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [46]:
# текст запроса
# выборка количества из таблицы industries без условий
query_3_4 = f'''
select count(*)
from industries
'''

In [47]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_3_4, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\2660507747.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_3_4, connection))

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных
# В среднем:
# - на одного работодателя приходится по 2 вакансии - не очень много. С учетом того, что у каких-то работодателей веротянее всего будет больше вакансий, должны быть также работодатели без вакансий;
# - в одном регионе 17 работодателей
# - в одном регионе 35 вакансий
# Количество сфер деятельности значительно меньшле количества работодателей, следовательно может быть много работодателей в одной и той же сфере деятелности

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [48]:
# текст запроса
query_4_1 = f'''
select
a.name area, -- название региона
count(*) cnt -- количество вакансий в регионе
from vacancies v -- выборка из таблицы вакансий
inner join areas a -- соединение с areas для получения наименований регионов
on v.area_id = a.id
group by a.id -- группировка по региону
order by 2 desc -- сортировка по cnt по убыв
limit 5 --первые 5 строк
'''

In [49]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_4_1, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\3476859337.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_1, connection))

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [50]:
# текст запроса
query_4_2 = f'''
select count(*)
from vacancies v
where
v.salary_from is not null -- заполнена зарплата от
or v.salary_to is not null -- или заполнена зарплата до
'''

In [51]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_4_2, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\1978865099.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_2, connection))

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [52]:
# текст запроса
query_4_3 = f'''
select
round(avg(v.salary_from)) avg_salary_from, -- среднее зарплата от
round(avg(v.salary_to)) avg_salary_to -- среднее зарплата до
from vacancies v
'''

In [53]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_4_3, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\2785199784.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_3, connection))

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [54]:
# текст запроса
query_4_4 = f'''
select
schedule,
employment,
count(*) cnt
from vacancies v
group by 1, 2 -- группировка по графику и типу трудоустройства
order by 3 desc -- сортировка по убыванию по количеству в группе график-тип трудоустройства
limit 1 offset 1 -- одна строка на второй позиции
'''

In [55]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_4_4, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\707161764.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_4, connection))

           schedule        employment   cnt
0  Удаленная работа  Полная занятость  7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [56]:
# текст запроса
query_4_5 = f'''
select
experience, -- опыт работы
count(*) cnt -- в каждой группировке вычисляется количетство строка
from vacancies v -- из таблицы вакансий
group by 1 -- строки группируются по опыту работы,
order by 2 -- результат сортируется по убыв. по количеству строк в группе
'''

In [57]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_4_5, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\297367241.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_4_5, connection))

           experience    cnt
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# выводы по детальному анализу вакансий
# 4.1. Наибольшее количество вакансий ожидаемо в больших городах (миллионниках) - столицах и областных центрах
# При этом не наблюдается прямой корелляции количества вакансий с численностью населения. Это можно увидеть на примере Новосибирск (1.6 млн) - 2006 вакансий, Алматы (ок. 2 млн.) - 1892 вакансии
# 4.2. Зарплата заполнена только у около 50% вакансий. Слишком большое количество пропусков. Веротяно на основе этих данных не получится построить модель прогнозирования заработной платы.
# Нужен дальнейший анализ пропусков.
# 4.3. Средние значения зарплат отличаются на 40%
# 4.4. Наибольшее количество вакансий - Удаленная работа с графиком Полная занятость - большая часть работодателей перешла на удаленную работу. Это могло должно иметь значение для зарплатной вилки,
# т.к. работодатели из городов-миллионников могут нанимать сотрудников из других регионов, а небоьшие работодатели из меньших регионов должны повышать зарплату, чтобы найти сотрудников
# 4.5. Если не рассматривать значения для "Нет опыта", то количество вакансий обратной зависит от опыта. Чем больше опыта, тем меньше количество вакансий.
# Т.к. работодатель стремится тратить меньше денег на зарплату, отсюда можно сделать предположение, что зарплата зависит от опыта - работодателю не хочется
# тратить больше денег на зарплату более опытным сотрудникам.
# Но и для сотрудников без опыта также много вакансий. Это может говорить о кадровом голоде - работодатели все чаще готовы брать даже сотрудников без опыта работы,
# а также о стремлении работодателей тратить меньше денег на зарплаты сотрудникам (если верно предположени о зависимости зарплаты от опыта).

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [58]:
# текст запроса
# запрос порлучает первые 5 работодателей в порядке убывания количества вакансий.
# первая строка в результате - первый по количеству, последняя строка - 5-й по количеству
query_5_1 = f'''
select
e.name employee_name,
count(*) cnt -- количество строк в разрезе работодателя
from vacancies v -- из таблицы вакансий
inner join employers e -- соединение с таблицей работодателей
on v.employer_id = e.id
group by e.id -- группировка по работодателю
order by 2 desc -- сортировка по количет
limit 5 -- первые 5 строк
'''

# если необходимо, чтобы запрос получал именно 1-го и 5-го работодателя, тогда можно сделать через объединение, но не получилось сделать без подзапросов, которых нет в пройденом материале.
# но самый лучший вариант по производительности - без объединения - через проверку значения оконной функции row_number(), но это за рамками пройденого материала
"""
query_5_1 = f'''
-- на первом месте
select employee_name, cnt
from
(select e.name employee_name, count(*) cnt
from vacancies v
inner join employers e
on v.employer_id = e.id
group by e.id
order by 2 desc
limit 1) t1

union all
-- на 5-м месте
select employee_name, cnt
from
(select e.name employee_name, count(*) cnt
from vacancies v
inner join employers e
on v.employer_id = e.id
group by e.id
order by 2 desc
limit 1 offset 4 -- 1 строка на 5-й позиции
) t2

'''
"""

"\nquery_5_1 = f'''\n-- на первом месте\nselect employee_name, cnt\nfrom\n(select e.name employee_name, count(*) cnt\nfrom vacancies v\ninner join employers e\non v.employer_id = e.id\ngroup by e.id\norder by 2 desc\nlimit 1) t1\n\nunion all\n-- на 5-м месте\nselect employee_name, cnt\nfrom\n(select e.name employee_name, count(*) cnt\nfrom vacancies v\ninner join employers e\non v.employer_id = e.id\ngroup by e.id\norder by 2 desc\nlimit 1 offset 4 -- 1 строка на 5-й позиции\n) t2\n\n'''\n"

In [59]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_5_1, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\3733234515.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_1, connection))

   employee_name   cnt
0         Яндекс  1933
1     Ростелеком   491
2       Тинькофф   444
3           СБЕР   428
4  Газпром нефть   331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [97]:
# текст запроса
# Этот запрос базируется на пройденом материале,
# но выполняется медленно (35+ сек.), т.к. агрегируется на соединении 3 таблиц.
query_5_2 = f'''
select
a.name area, -- название региона
count(distinct e.id) cnt_employer, -- количество работодателей в регионе (количество не-null значений e.id)
count(distinct v.id) cnt_vac -- количество вакансий в регионе (количество не-null значений v.id)
from areas a -- выборка из таблицы регионов
left join vacancies v on v.area_id = a.id -- соединение с таблицей вакансий
left join employers e on e.area = a.id -- соединение с таблицей работодателей
group by a.id -- группировка по региону
having count(v.id) = 0 -- Среди регионов, в которых нет вакансий
order by 2 desc -- сортировка по убыванию кроичества работодателей по убыв.
limit 1 -- только первая строка - для ответа на вопрос в задании
'''

# быстрый (<2 сек.) вариант запроса, но не базируется на пройденом материале
"""
query_5_2 = f'''
select a.name,
(select count(*) from employers e where e.area = a.id) cnt_employer, -- вычисление подзапросом количества работодателей в регионе только для регионов без вакансий
0 cnt_vac -- 0 вакансий в регионе
from areas a
where not exists(select from vacancies v where v.area_id = a.id) -- проверка подзапросом отсутствия хотя бы одной вакансии в регионе
order by 2 desc -- сортировка по убыванию кроичества работодателей по убыв.
limit 1 -- только первая строка - для ответа на вопрос в задании
'''
"""

"\nquery_5_2 = f'''\nselect a.name,\n(select count(*) from employers e where e.area = a.id) cnt_employer, -- вычисление подзапросом количества работодателей в регионе только для регионов без вакансий\n0 cnt_vac -- 0 вакансий в регионе\nfrom areas a\nwhere not exists(select from vacancies v where v.area_id = a.id) -- проверка подзапросом отсутствия хотя бы одной вакансии в регионе\norder by 2 desc -- сортировка по убыванию кроичества работодателей по убыв.\nlimit 1 -- только 1 строка\n'''\n"

In [98]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_5_2, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\3538269644.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_2, connection))

     area  cnt_employer  cnt_vac
0  Россия           410        0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [101]:
# текст запроса
query_5_3 = f'''
select
e.name emp_name, -- наименование работодателя
count(distinct v.area_id) cnt_area -- количество различных регионов с вакансиями работодателя
from
employers e -- из таблицы работодателей
inner join vacancies v -- соединение с таблицей вакансий
on v.employer_id = e.id
group by e.id -- группировка по работодателю
order by 2 desc -- сортировка по убыванию количества регионов
limit 1 -- необходима только первая строка для ответа на вопрос в задании
'''

In [102]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_5_3, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\2800149791.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_3, connection))

  emp_name  cnt_area
0   Яндекс       181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [65]:
# текст запроса
query_5_4 = f'''
select count(*) cnt
from
employers e -- из таблицы работодателей
left join employers_industries ei -- соединение с таб лицей сфер деятельности - левое, т.к. сфер деятельности может не быть
on ei.employer_id = e.id
where
ei.employer_id is null -- проверка условия отсутствия какой-либо сферы деятельности
'''

In [66]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_5_4, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\2368366468.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_4, connection))

    cnt
0  8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [67]:
# текст запроса
query_5_5 = f'''
select
e.name, -- название работодателя
count(*) cnt -- количество строк в разрезе работодателя
from
employers e -- из таблицы работодалелей
inner join employers_industries ei -- соединение с таблицей сфер деятельности, внутренее - т.к. нужны работодатели только с наличием сфер деятельности
on ei.employer_id = e.id
group by e.id -- группировка по работодателю
having count(*) = 4 -- где количество сфер детельности ровно 4
order by 1 -- сортировка по названию работодателя
limit 1 offset 2 -- находящейся на третьем месте
'''

In [68]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_5_5, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\1239240039.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_5, connection))

   name  cnt
0  2ГИС    4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [69]:
# текст запроса
query_5_6 = f'''
select
count(e.id) cnt -- количество работодателей
from
employers e -- из таблицы работодателей
inner join employers_industries ei -- соединение с таблицей сфер деятельности работодателя
on ei.employer_id = e.id
inner join industries i
on ei.industry_id = i.id
where i.name = 'Разработка программного обеспечения' -- проверка сферы деятельности
'''

In [70]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_5_6, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\798226071.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_6, connection))

    cnt
0  3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [71]:
# Код для получения списка городов-милионников.
# Не нашел на странице никакого файла или API, откуда можно получить список.
# Поэтому реализовал через парсинг содержимого страницы в соответствии с пройденым материалом.
# У таблицы на странице нет никакого id. Поэтому при изменении страницы парсинг может стать
# неработоспособным.
import requests
from bs4 import BeautifulSoup # использование BeautifulSoup для парсинга
url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response = requests.get(url)
page = BeautifulSoup(response.text, 'html.parser')
millionaire_cities_list = []
# Выборка из второй таблицы на странице, проход по строкам и получение содержимого второй ячейки.
# Все содержимое добавляется в список millionaire_cities_list
for row in page.findAll('table')[1].tbody.findAll('tr'):
    tds = row.findAll('td')
    if (len(tds) > 1):
        millionaire_cities_list.append(row.findAll('td')[1].findAll('a')[0].contents[0])

millionaire_cities = tuple(millionaire_cities_list) # формирование кортежа для возможности использования параметра в запросе

#Альтернативный вариант без парсинга страницы, через хардкод
#millionaire_cities = ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')

In [73]:
# текст запроса
query_5_7 = f'''
select
a.name, -- название региона
count(v.id) -- количество вакансий в регионе
from
employers e -- из таблицы работодателей
inner join vacancies v -- соединение с таблицей вакансий
on v.employer_id = e.id
inner join areas a -- соединение с таблицей регионов
on v.area_id = a.id
where e.name = 'Яндекс' -- отбор по компании Яндекс
and a.name in {millionaire_cities}
group by a.id -- группировка по региону

-- Вычисление общего количества. Аналогично первому запросу, только без группировки по региону
union all
select 'Total', count(v.id)
from
employers e
inner join vacancies v
on v.employer_id = e.id
inner join areas a -- соединение с таблицей регионов
on v.area_id = a.id
where e.name = 'Яндекс'
and a.name in {millionaire_cities}
group by 1
order by 2
'''

In [74]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_5_7, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\1043306142.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_5_7, connection))

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7            Самара     26
8               Уфа     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            Total    485

***

In [ ]:
# выводы по анализу работодателей
# 5.1. На первом месте по количеству вакансий - компании из сферы IT, на 5-м - из нефтегазовой сферы. Говорит о большой востребованности именно IT-специальностей (либо в базе на hh.ru по большей части IT-вакансии)
# 5.2. Наибольшее количество работодателей в кгородах-миллионниках, т.е. количество работодателей кореллирует с численностью населения
# 5.3. На первом месте по количеству регионов - Яндекс, которая не является территориально-распеределенной, следовательно количество регионов должно быть обусловлено удаленной работой.
# Остальные компании в top10 - похожи на территориально распределенные (Почта России). Но учитывая IT-направленность вакансий в базе, большое количество вакансий в регионах также должно быть обусловлено удаленной работой.
# 5.4. У около трети работодателей не заполнена сфера деятельности. Нужен доп. анализ данных для понимания, возможно ли использовать сферу деятельности для построения модели.
# 5.5. Вывод не удалось сделатью
# 5.6. 14% работодателей занимаются разработкой ПО
# 5.7. Количество вакансий кореллирует с численностью населения

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [75]:
# текст запроса
query_6_1 = f'''
select
count(*) -- количество строк
from
vacancies v -- из таблицы вакансий
where
v.name ilike '%data%' -- наименование вакансии содержит "data" (ilike - без учета регистра)
or v.name ilike '%данн%' -- наименование вакансии содержит "данн" (ilike - без учета регистра)
'''

In [76]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_6_1, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\1112087435.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_1, connection))

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [77]:
# текст запроса
query_6_2 = f'''
select
count(*) -- количество строк
from
vacancies v -- из таблицы вакансий
where
(v.name ilike '%junior%' or v.experience = 'Нет опыта' or employment = 'Стажировка') -- проверка условия вакансии Junior
and (v.name ilike '%data scientist%' -- проверка названия вакансии на отношение к професии дата-сайентиста через содержание подстроки в названии (ilike - без учета регистра)
or v.name ilike '%data science%'
or v.name ilike '%исследователь данных%'
or v.name like '%ML%' and not v.name ilike '%HTML%' -- содержит ML, но не содержит HTML
or v.name ilike '%machine learning%'
or v.name ilike '%машинн%обучен%%')
'''

In [78]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_6_2, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\1398670876.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_2, connection))

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [79]:
# текст запроса
query_6_3 = f'''
select
count(*)
from
vacancies v
where
(v.name ilike '%data scientist%' -- проверка названия вакансии на отношение к професии дата-сайентиста как в запросе 6.2
or v.name ilike '%data science%'
or v.name ilike '%исследователь данных%'
or v.name like '%ML%' and not v.name ilike '%HTML%'
or v.name ilike '%machine learning%'
or v.name ilike '%машинн%обучен%%')
and (v.key_skills ilike '%SQL%' or v.key_skills ilike '%postgres%') -- проверка наличия навыка SQL
'''

In [80]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_6_3, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\719336968.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_3, connection))

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [81]:
# текст запроса
query_6_4 = f'''
select count(*)
from
vacancies v
where
(v.name ilike '%data scientist%' -- проверка названия вакансии на отношение к професии дата-сайентиста как в запросе 6.2
or v.name ilike '%data science%'
or v.name ilike '%исследователь данных%'
or v.name like '%ML%' and not v.name ilike '%HTML%'
or v.name ilike '%machine learning%'
or v.name ilike '%машинн%обучен%%')
and (v.key_skills ilike '%Python%') -- проверка навыка по Python
'''

In [82]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_6_4, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\876087413.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_4, connection))

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [83]:
# текст запроса
query_6_5 = f'''
select
-- определение количества слов как Количество запятых + 1. avg() для вычисления среднего, round() - для округления результата до 2 знаков
round(avg(1 + length(v.key_skills) - length(REPLACE(v.key_skills, CHR(9)::text, ''))), 2)
from
vacancies v
where
(v.name ilike '%data scientist%' -- проверка названия вакансии на отношение к професии дата-сайентиста как в запросе 6.2
or v.name ilike '%data science%'
or v.name ilike '%исследователь данных%'
or v.name like '%ML%' and not v.name ilike '%HTML%'
or v.name ilike '%machine learning%'
or v.name ilike '%машинн%обучен%%')
and (v.key_skills is not null)
'''

In [84]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_6_5, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\2828293100.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_5, connection))

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [85]:
query_6_6 = f'''
select
experience, -- опыт
-- вычисление средней зарплаты
-- coalesce(v.salary_from, v.salary_to) - если v.salary_from null, тогда coalesce(v.salary_from, v.salary_to) + coalesce(v.salary_to, v.salary_from))/2 = v.salary_to
-- coalesce(v.salary_to, v.salary_from) - если v.salary_to null, тогда coalesce(v.salary_from, v.salary_to) + coalesce(v.salary_to, v.salary_from))/2 = v.salary_from
-- если v.salary_to не null и v.salary_from не null - тогда coalesce(v.salary_from, v.salary_to) + coalesce(v.salary_to, v.salary_from))/2 = (v.salary_from + v.salary_to) / 2
-- avg() для вычисления среднего, round() - для округления результата до целого
round(avg((coalesce(v.salary_from, v.salary_to) + coalesce(v.salary_to, v.salary_from))/2)) as avg_salary
from
vacancies v
where
(v.name ilike '%data scientist%' -- проверка названия вакансии на отношение к професии дата-сайентиста как в запросе 6.2
or v.name ilike '%data science%'
or v.name ilike '%исследователь данных%'
or v.name like '%ML%' and not v.name ilike '%HTML%'
or v.name ilike '%machine learning%'
or v.name ilike '%машинн%обучен%%')
and (v.salary_from is not null or v.salary_to is not null) -- заполнено хотябы одно из полей вилки зарплаты
group by 1 -- группировка по опыту
'''

In [86]:
# выполнение запроса и отображение резльтата
display(pd.read_sql_query(query_6_6, connection))

C:\Users\User\AppData\Local\Temp\ipykernel_11164\3044105066.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  display(pd.read_sql_query(query_6_6, connection))

           experience  avg_salary
0           Нет опыта     74643.0
1  От 1 года до 3 лет    139675.0
2       От 3 до 6 лет    243115.0

***

In [87]:
# закрытие соединения с БД
connection.close()

In [ ]:
# выводы по предметному анализу
# 6.1. С data-sience связано 4% вакансий - много это или мало - нужно сравнить с другими вакансиями;
# 6.2. Для начинающих дата-саентистов вакансий мало - всего 51 (около 3% от общего количества вакансий из 6.1), следовательно в этой сфере работодателем востребованы только опытные дата-саентисты.
# 6.3, 6.4. Владение SQL (11% от 6.1) и Python (20% от 6.1) является предпочтительным, но не в подавляющем количестве вакансий. По Python - наверное, анамалия в данных, т.к. все говорят, что для DS нужен обязательно Python, и, веротяно, должно быть около 100%;
# 6.5. В среднем для DS нужно 6 навыков, что говорит о необходимой высокой квалификации DS и о смежности этой профессии;
# 6.6. Зарплатная вилка напрямую корреллирует с опытом работы. Наиболее высоко ценятся опытные DS-специалисты.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# Наибольшее количество вакансий - в сфере IT. Наиболее высокие зарплаты в регионах-миллионниках.
# Наблюдается тенденция - все больший переход на удаленную работу. Прогноз - снижение роли региона в формировании зарплатной вилки, выравнивание вилки зарплат по регисонам.